let staffService = {
    getStaffList(){
        let p = new Promise((resolve, reject)=>{
            let data = [
                {a: '232是是是131',b:'但是',c:'水电费',d:'地方',e:'df'},
                {a: '23342131',b:'但是',c:'水电费',d:'地方',e:'df'},
                {a: '232rtt131',b:'但是',c:'水电费',d:'地方',e:'df'},
                {a: '2ee32131',b:'但是',c:'水电费',d:'地方',e:'df'},
                {a: '232131rr',b:'但是',c:'水电费',d:'地方',e:'df'},
            ]
            resolve(data)
        })
        return p;
    },
    
    getStaffDetail(){
        let p = new Promise((resolve, reject)=>{
            let data = {
                a: '1111',
                b: '2015-03-04',
                c: '',
                isLiudong: false,
                ssmd: '',
                fwmd: ['中央门店2'],
                fwxm: [''],
                rate: 3,
                tags: ['地方','哈哈','通天塔','方法','地方','哈哈','通天塔','方法'] ,
                fwList: [{a:'123'},{a:'123'},{a:'123'},{a:'123'},{a:'123'},{a:'123'}],
                paibanList: [{a:'123'},{a:'123'},{a:'123'},{a:'123'},{a:'123'},{a:'123'}],
                kqList: [{a:'123'},{a:'123'},{a:'123'},{a:'123'},{a:'123'},{a:'123'}],
                jb:'3级',
                sfxs: '120%',
                tcxs: '1%'
            }
            resolve(data)
        })
        return p;
    },
    
    getGwList(){
        let p = new Promise((resolve, reject)=>{
            let data = [{a: 'dssssd', b:'121'},{a: 'ds2d', b:'121'}]
            resolve(data)
        })
        return p;
    },
    getSchedulingList(){
        let p = new Promise((resolve, reject)=>{
            let data = [
                {shopName: '弘扬总店',showAll: 'true', peopleList: [
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                ]},
                {shopName: '弘扬总店2',showAll: 'true', peopleList: [
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                ]},
                {shopName: '弘扬总店3',showAll: 'true', peopleList: [
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '上','上','上','上','上','上','上','上','上','上','上,周','上,周','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上','上'
                    ]},
                ]},

            ]
            resolve(data)
        })
        return p;
    },
    getStaffWorktime(){
        let p = new Promise((resolve, reject)=>{
            let data = [
                {shopName: '弘扬总店',showAll: 'true', peopleList: [
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                ]},
                {shopName: '弘扬总店2',showAll: 'true', peopleList: [
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                ]},
                {shopName: '弘扬总店3',showAll: 'true', peopleList: [
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                    {name: '张三', position: '店长', dayList: [
                        '0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1','2','3','0','1'
                    ]},
                ]},

            ]
            resolve(data)
        })
        return p;
    }

}
export { staffService }